

//public class Main {
//    public static void main(String[] args) {
//        //операторы сравнения</>/>=/<=/
//        int x = 10;
//        int y = 12;
//        int z = 10;
//        System.out.println(x < y);//true
//        System.out.println(x > y);//false
//        System.out.println(x <= y);//true
//        System.out.println(x >= z);//false
//
//        System.out.println(x == z);//true равенство
//        System.out.println(x != z);//false неравенство
//
//        int height = 135; //допустимая высота человека
//        if (height >= 120) {
//            System.out.println("Проходи на калесо");
//        }
//        int height1 = 100; //допустимая высота человека
//        if (height >= 120) {
//            System.out.println("Проходи на калесо");// тогда нничего не выдаст в результате
//            System.out.println("Не забудьте пристигнутся");
//        }
//        Scanner scanner = new Scanner(System.in);
//        System.out.println("Введите возраст: ");
//        int age = scanner.nextInt();
//        if (age > 26) {
//            System.out.println("Я могу продать Вам билет");
//        }
//        if (age <= 26) {
//            System.out.println("Вот ваш проездной");
//        }
//        int numberOfHands = 1;
//        if (numberOfHands == 2) {
//            System.out.println("Все ок");
//        } else {
//            System.out.println("Бегите скорее в госпиталь");
//        }
//        Scanner scanner2 = new Scanner(System.in);
//        System.out.println("Сколько у Васдетей: ");
//        int kids = scanner2.nextInt();
//        if (kids <= 2) {
//            System.out.println("Счасливчик");
//        } else {
//            System.out.println("ну ты погоди");
//        }
        // != если не равно
//        // == != мы можем использовать с премитивными типами
//        Scanner scanner2 = new Scanner(System.in);
//        System.out.println("Сколько слово: ");
//        String answer = scanner2.nextLine();
//        char first = answer.charAt(0);
//        if ( first  == 'A') {
//            System.out.println("горече");
//        }
//        if (answer.length() == 8){
//            System.out.println("нужная длинна");
//        }
//        // тип булиан имеет только два значения true или false
//        //в переменную булиан мы можем сохранить результат проверки какого либо условия
//        boolean b1 = 5>16;
//        System.out.println(b1); //false
//        if (b1){
//            System.out.println("Boom");
//        }
        //Задание 1
        //Пусть пользователь введет свою температуру: например, 38.8.
        //Если температура больше 39, выведите в консоль фразу:
        // «Нужно срочно обратиться к врачу». Если температура меньше, то выведите фразу: «Лечитесь дома»


//        Scanner scanner8 = new Scanner(System.in);
//        System.out.println("Напишите какая у Вас температура: ");
//        int Temperature = scanner8.nextInt();
//        if (Temperature >= 39) {
//            System.out.println("Нужно срочно к врачу");
//        } else {
//            System.out.println("Лечитесь дома");
//        }
//}
//}