public class Main {
    public static void main(String[] args) {
//----------------------------------------------while_intro------------------------------------------
//        int i = 0;
//        while (i > 10) {
//            System.out.println(i);
//            i++;
//        }
//        int j = 0;
//        while (i < 15){
//        i--; // j = j-1; случайно создали безконечный цыкл
//    }
//        int i = 75;
//        while (i < 137) {
//            System.out.println(i);
//            i++;
//        }
//        int i = -75;
//        while (i > -99) {
//            System.out.println(i);
//            i--;
//        }
//        int m = 0;
//        while (m < 30){
//            System.out.println("Слово");
//            m++;
//        }
        //-------------------------------------------------------------------------------------------------
        // Выводить в консоль цифры от одного до ста
        // если число кратно 3-м (делится на три без остатка)
        // то мы выводим еще слово "бинго"
//        int m = 0;
//        while (m < 100) {
//                if (m % 3 == 0) {  //если число кратное 3
//                    System.out.println(m + "Бинго");
//                } else {
//                    System.out.println(m);
//                }
//                m++;
//            }
//        int f =1;
//        while (f<20){
//            System.out.println(f);
//            f = f + 2;
//            }
//-----------------------------------------------------------------------------------------------------
        //синтаксический сахар
        // a = a + 1 можно изменить на a +=1 либо a++;
        // a = a+2  можно изменить на  a +=2;
        // a = a * 9 можно изменить на a *=9;
        // a = a/4 можно изменить на a/=4;
        // a = a + "слово" можно изменить на a+="слово";
//-------------------------------------------------------------------------------------------------------
//        String str1 = "oh";
//        str1 += "Yehe";
//        System.out.println(str1);
//        addSeven ();

        //Выведите в консоль такую последовательность чисел 1 2 4 8 16 32 64 128 256 512.

//        int z = 1;
//        while (z < 513) {
//            System.out.println(z);
//            z *= 2;
//        }
        //--------------------------------------------------------------------------------------------
//        Имануил Кант любит считать свои шаги во время прогулки.
//        Прогулка его составляет 300 шагов.
//        Каждый шаг он считает в слух.
//        Но вместо чисел кратных 6 (это числа, которые делятся на 6 без остатка) он говорит - "Himmel und Erde".
//        Вместо ста он заявляет "Sagen Sie mir, kann man in Ihrem Land durch Null teilen?"
//        Выведите этот разговор Канта с самим собой в консоль.
//        int step = 0;
//        while (step <= 300) {
//            if (step % 6 == 0) {
//                System.out.println("Himmel und Erde");
//            } else if (step == 100) {  // но или если
//                System.out.println("Sagen Sie mir, kann man in Ihrem Land durch Null teilen?");
//            } else {
//                System.out.println(step);
//            }
//            step++;
//        }
//    }
//}

        //------------------------------------------------------------------------------------------------
//        addSeven ();
//    }
//            //Напишите метод.
//            // Каждый раз когда мы его вызываем - он печатает числа 7 14 21 28 35 ... 98.
//            // Метод ничего не принимает.
//        public static void addSeven (){
//        int f =7;
//        while (f<=100){
//            System.out.println(f);
//            f += 7;
//           }


        }
    }

